# -------------------------------------
# Taps
# -------------------------------------
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "stripe/stripe-cli"

# -------------------------------------
# Essential CLI Tools
# -------------------------------------
brew "gh"                   # GitHub CLI
brew "git"                 # Git
brew "go"                  # Go language
brew "node"                # For tools like pnpm or frontend work
brew "pnpm"                # Fast JS package manager
brew "wget"                # Networking utility
brew "curl"                # HTTP client
brew "zoxide"              # Smarter cd command
brew "ripgrep"             # Super-fast grep replacement
brew "fd"                  # Fast file finder
brew "eza"                 # Modern ls replacement
brew "bat"                 # Better cat
brew "fzf"                 # Fuzzy finder
brew "lazygit"             # Terminal Git UI
brew "tmux"                # Terminal multiplexer
brew "neovim"              # Your main editor
brew "tree-sitter"         # Syntax parser for Neovim
brew "luajit"              # For Neovim plugins
brew "jq"                  # JSON parser
brew "sqlite"              # Lightweight DB (for local dev or testing)
brew "openssl@3"           # SSL/TLS
brew "zsh"                 # Shell
brew "zstd"                # Compression

# -------------------------------------
# Dev Tools & Services
# -------------------------------------
brew "docker"              # Container engine
brew "docker-completion"  # Shell completion
brew "stripe/stripe-cli/stripe" # Stripe dev CLI

# -------------------------------------
# Casks (Apps)
# -------------------------------------
cask "iterm2"              # Terminal
cask "arc"                 # Browser
cask "figma"               # Design
cask "shottr"              # Screenshot tool
cask "bruno"               # API testing (local alternative to Postman)
cask "linear-linear"       # PM tool (if you use it)
cask "obs"                 # Recording
cask "mos"                 # Smooth scrolling
cask "raycast"             # Spotlight replacement

