# -------------------------------------
# Taps
# -------------------------------------
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "stripe/stripe-cli"

# -------------------------------------
# Essential CLI Tools
# -------------------------------------
brew "gh"                   # GitHub CLI
brew "git"                 # Git
brew "go"                  # Go language
brew "node"                # For tools like pnpm or frontend work
brew "pnpm"                # Fast JS package manager
brew "curl"                # HTTP client
brew "ripgrep"             # Super-fast grep replacement
brew "fd"                  # Fast file finder
brew "eza"                 # Modern ls replacement
brew "bat"                 # Better cat
brew "zsh"                 # Shell

# -------------------------------------
# Dev Tools & Services
# -------------------------------------
cask "docker"              # Container engine
brew "stripe/stripe-cli/stripe" # Stripe dev CLI

# -------------------------------------
# Casks (Apps)
# -------------------------------------
cask "arc"                 # Browser
cask "figma"               # Design
cask "shottr"              # Screenshot tool
cask "httpie"               # API testing (local alternative to Postman)
cask "obs"                 # Recording
cask "mos"                 # Smooth scrolling
cask "raycast"             # Spotlight replacement
